{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "b7b668e5",
   "metadata": {},
   "source": [
    "APPLICATION B"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "3d23920a",
   "metadata": {},
   "outputs": [],
   "source": [
    "from applications.b_queries import main"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6523720b",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (a) { ... }} {position: line: 3, column: 5, offset: 26} for query: '\\n    MATCH (a:Author)\\n    CALL {\\n       WITH a\\n       MATCH (a)<-[:WRITTEN_BY]-(p:Paper)\\n       OPTIONAL MATCH (p)<-[:CITED_BY]-(cp:Paper)\\n       WITH p, count(cp) as citations\\n       ORDER BY citations DESC\\n       RETURN collect(citations) as sortedCitations\\n    }\\n    UNWIND range(0, size(sortedCitations)-1) as idx\\n    WITH a, sortedCitations, idx, sortedCitations[idx] as currentCitation\\n    WHERE currentCitation >= idx + 1\\n    RETURN a.name as Author, max(idx + 1) as hIndex\\n    '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Query 1: Top 3 most cited papers for each Journal\n",
      "\n",
      "Journal: Acta Cirurgica Brasileira\n",
      "  1. Glugoides (Citations: 17)\n",
      "  2. SURVIVAL OF B LYMPHOCYTES IS PROLONGED AFTER INFECTION WITH IMMORTALIZING VIRUSES (Citations: 2)\n",
      "\n",
      "Journal: Akdeniz Havzası ve Afrika Medeniyetleri Dergisi\n",
      "  1. BTS-BI APPLICATION (INDONESIAN STUDENT TEXT BOOK) BASED ON ANDROID (Citations: 11)\n",
      "  2. A Study on the Shang Dynasty’s Educational Culture, based on Oracle Bone Scripts (Citations: 9)\n",
      "\n",
      "Journal: Artefactual Field Experiments\n",
      "  1. Glück im Pragmatismus (Citations: 24)\n",
      "\n",
      "Journal: Cardiac Cath Lab Director\n",
      "  1. Filters and Resonators (Citations: 4)\n",
      "\n",
      "Journal: Charm Sains: Jurnal Pendidikan Fisika\n",
      "  1. The U.S. Government must stand up for human rights in Kenya (Citations: 6)\n",
      "\n",
      "Journal: Faraday Symposia of the Chemical Society\n",
      "  1. Efekty uczestnictwa inwestorów zagranicznych w polskiej rzeczywistości gospodarczej przełomu wieków (Citations: 23)\n",
      "  2. Study on ultrasonic-assisted drilling of Ti6Al4V using 3-flute drill in the finite element simulation (Citations: 11)\n",
      "  3. Why the Human Penis is Larger than in the Great Apes (Citations: 1)\n",
      "\n",
      "Journal: Foundations and Trends® in Marketing\n",
      "  1. Bumpless transfer with and without controller uncertainty: Resolution of key implementation issues (Citations: 16)\n",
      "\n",
      "Journal: Intereconomics. Review of European Economic Policy\n",
      "  1. Using capacitive sensors for in situ calibration of displacements in a piezo-driven translation stage of an STM (Citations: 25)\n",
      "\n",
      "Journal: International Journal of Brain Science\n",
      "  1. Urban form, health, and the law's limits. (Citations: 21)\n",
      "  2. Pesca e navigazione in Sardegna nell'antichità (Citations: 5)\n",
      "\n",
      "Journal: J-Kesmas: Jurnal Fakultas Kesehatan Masyarakat (The Indonesian Journal of Public Health)\n",
      "  1. Przegląd metod obliczania parametrów fal podmuchowych (Citations: 17)\n",
      "  2. Obligatorisk redovisning av sjukfrånvaro : Hur förbereder sig privata företag inför lagen? - Kan lagen vara en början till att bättre synliggöra personalekonomi? (Citations: 11)\n",
      "\n",
      "Journal: JOSEPHA: Journal of Sport Science And Physical Education\n",
      "  1. Bottom-up forcing of growth and condition changes in Northwest Atlantic capelin (Mallotus villosus) during the 1990s : evidence from feeding indices (Citations: 12)\n",
      "\n",
      "Journal: Journal of korean academy of advanced general dentistry\n",
      "  1. Mappings and homological properties in the Conley index theory (Citations: 17)\n",
      "  2. Making programming education more accessible for visually impaired (Citations: 8)\n",
      "  3. Book Review: The Destiny of Man (Citations: 6)\n",
      "\n",
      "Journal: Khulasah : Islamic Studies Journal\n",
      "  1. 弗罗姆“人性异化论”探析 (Citations: 13)\n",
      "  2. Methylated spirit burns following traditional hair dressing practice. (Citations: 6)\n",
      "  3. South Carolina colonial land policies (Citations: 2)\n",
      "\n",
      "Journal: Kocaeli Üniversitesi Fen Bilimleri Dergisi\n",
      "  1. Surface Water Treatment with Natural Starches as Coagulant via Coagulation Process (Citations: 2)\n",
      "  2. 再考 スポーツに必要な栄養の話 : 基本となること 聞いてみたいこと 実践したいこと(第3回)パフォーマンスを上げる食事,栄養の話 (Citations: 2)\n",
      "\n",
      "Journal: Les Études philosophiques\n",
      "  1. Il progetto della friche per le periferie residenziali (Citations: 18)\n",
      "\n",
      "Journal: Machine Learning Research\n",
      "  1. Arte rupestre na província de Misiones/Argentina: o sítio Campo Yabebirí (Citations: 15)\n",
      "  2. A method for determining the position of a paper machine body and a measuring apparatus used in the method (Citations: 14)\n",
      "\n",
      "Journal: OECD Economic Studies\n",
      "  1. Spectrophotometric titration of water in acetic acid (Citations: 17)\n",
      "  2. Ixazomib, Lenalidomide, and Dexamethasone (IRD) Treatment with Cytogenetic Risk-Based Maintenance in Transplant-Eligible Myeloma: A Phase 2 Multicenter Study by the Nordic Myeloma Study Group (Citations: 4)\n",
      "\n",
      "Journal: Ocean & Coastal Law Journal\n",
      "  1. The Art of Walking and the Mindscapes of Trauma in Thomas De Quincey’s Autobiographical Works: The Pains of Wandering, the Pains of Remembering (Citations: 9)\n",
      "  2. Le marché des matières premières dans l’Antiquité et au Moyen Âge (Citations: 8)\n",
      "\n",
      "Journal: PETITUM\n",
      "  1. Denis Smith, Gentle Patriot – A Political Biography of Walter Gordon . Edmonton: Hurtig Publishers, 1973, pp. 416. (Citations: 21)\n",
      "  2. An alternative method of intraoperative skin retraction: the Walton fish hook. (Citations: 20)\n",
      "\n",
      "Journal: Pernatye Hiŝniki i Ih Ohrana\n",
      "  1. Chapter 12: General discussion and future perspectives (Citations: 18)\n",
      "  2. Exploration of Reading Teaching Strategies under the Senior English Curriculum Reforms (Citations: 2)\n",
      "\n",
      "Journal: Photonics\n",
      "  1. A review on the research and fisheries of Barramundi, reef fish, dugongs, turtles and spanish mackerel in the Papua New Guinea side of the Torres Strait (Citations: 22)\n",
      "\n",
      "Journal: SAGE Open Medicine\n",
      "  1. Indian science adviser caught up in plagiarism row (Citations: 25)\n",
      "\n",
      "Journal: Sewanee Review\n",
      "  1. Achievements and prospects in the control of helminthiases in Bulgaria. (Citations: 20)\n",
      "\n",
      "Journal: TERAJU\n",
      "  1. Russian Financial Development Institutions (Citations: 18)\n",
      "\n",
      "Journal: The Catholic Biblical Quarterly\n",
      "  1. 인간과 자연 - 환경문제의 개관 및 환경논리의 제언 - (Citations: 7)\n",
      "\n",
      "Journal: The Korea  Journal of Buddhist Professors\n",
      "  1. 216 炭酸固定醗酵に関する研究 : (第23報) スエヒロタケのL-リンゴ酸醗酵に及ぼす無機化合物の影響 (Citations: 8)\n",
      "  2. System monitorowania węzłów cieplnych (Citations: 7)\n",
      "\n",
      "Journal: Transactions on Electrical and Electronic Materials\n",
      "  1. Evaluating the impact of the center control touch screen of new energy vehicles on user visual imagery and preferences (Citations: 9)\n",
      "\n",
      "Journal: Vodosnabzhenie i sanitarnaia tehnika\n",
      "  1. Influence of pollination modes on yield components in strawberry (Fragaria x ananassa Duch.) (Citations: 15)\n",
      "\n",
      "Journal: World journal of life sciences research\n",
      "  1. Kahramanmaraş Organize Sanayi Bölgesi’nin çevresindeki yerleşmelere olan etkileri (Citations: 11)\n",
      "\n",
      "Query 2: Journal communities (authors with >= 4 papers in the Journal)\n",
      "No journal communities found.\n",
      "\n",
      "Query 3: Journal Impact Factor (average citations per paper)\n",
      "Journal: Machine Learning Research -> Impact Factor: 14.50\n",
      "Journal: International Journal of Brain Science -> Impact Factor: 13.00\n",
      "Journal: Journal of korean academy of advanced general dentistry -> Impact Factor: 7.40\n",
      "Journal: JOSEPHA: Journal of Sport Science And Physical Education -> Impact Factor: 12.00\n",
      "Journal: Intereconomics. Review of European Economic Policy -> Impact Factor: 25.00\n",
      "Journal: Faraday Symposia of the Chemical Society -> Impact Factor: 11.67\n",
      "Journal: Acta Cirurgica Brasileira -> Impact Factor: 9.50\n",
      "Journal: Cardiac Cath Lab Director -> Impact Factor: 4.00\n",
      "Journal: Khulasah : Islamic Studies Journal -> Impact Factor: 7.00\n",
      "Journal: Transactions on Electrical and Electronic Materials -> Impact Factor: 9.00\n",
      "Journal: SAGE Open Medicine -> Impact Factor: 25.00\n",
      "Journal: Foundations and Trends® in Marketing -> Impact Factor: 16.00\n",
      "Journal: The Catholic Biblical Quarterly -> Impact Factor: 7.00\n",
      "Journal: PETITUM -> Impact Factor: 20.50\n",
      "Journal: Pernatye Hiŝniki i Ih Ohrana -> Impact Factor: 10.00\n",
      "Journal: OECD Economic Studies -> Impact Factor: 10.50\n",
      "Journal: Vodosnabzhenie i sanitarnaia tehnika -> Impact Factor: 15.00\n",
      "Journal: TERAJU -> Impact Factor: 18.00\n",
      "Journal: Photonics -> Impact Factor: 22.00\n",
      "Journal: World journal of life sciences research -> Impact Factor: 11.00\n",
      "Journal: Les Études philosophiques -> Impact Factor: 18.00\n",
      "Journal: Charm Sains: Jurnal Pendidikan Fisika -> Impact Factor: 6.00\n",
      "Journal: J-Kesmas: Jurnal Fakultas Kesehatan Masyarakat (The Indonesian Journal of Public Health) -> Impact Factor: 14.00\n",
      "Journal: Kocaeli Üniversitesi Fen Bilimleri Dergisi -> Impact Factor: 2.00\n",
      "Journal: Ocean & Coastal Law Journal -> Impact Factor: 8.50\n",
      "Journal: Artefactual Field Experiments -> Impact Factor: 24.00\n",
      "Journal: Sewanee Review -> Impact Factor: 20.00\n",
      "Journal: The Korea  Journal of Buddhist Professors -> Impact Factor: 7.50\n",
      "Journal: Akdeniz Havzası ve Afrika Medeniyetleri Dergisi -> Impact Factor: 10.00\n",
      "\n",
      "Query 4: Authors' h-index\n",
      "Author: 晓红 武 -> h-index: 1\n",
      "Author: Isador H. Coriat -> h-index: 1\n",
      "Author: Abdul Amir H Kadhum Abdul Amir H Kadhum -> h-index: 3\n",
      "Author: Shunji Itoh -> h-index: 3\n",
      "Author: RJ Milligan -> h-index: 3\n",
      "Author: M. Winter -> h-index: 6\n",
      "Author: Jia Jie Yan -> h-index: 3\n",
      "Author: Juan Carlos Gonzalez Delgado -> h-index: 4\n",
      "Author: Kayven Wayne Beemer -> h-index: 2\n",
      "Author: Ю А Мамаев -> h-index: 2\n",
      "Author: Y. Postdlsky -> h-index: 1\n",
      "Author: Thomas Blake -> h-index: 2\n",
      "Author: Anastasiya A. Skvortsova -> h-index: 3\n",
      "Author: Jacques Moden -> h-index: 3\n",
      "Author: CA Madden Hof -> h-index: 1\n",
      "Author: Rodrigo Nogueira Alves Carneiro -> h-index: 3\n",
      "Author: Donna Brockmeyer-Klebaum -> h-index: 4\n",
      "Author: Alex Kaiko -> h-index: 4\n",
      "Author: Diaz G. -> h-index: 1\n",
      "Author: Burak Taşova -> h-index: 1\n",
      "Author: Alejandro M Auza Torres -> h-index: 4\n",
      "Author: Susmita Hairul -> h-index: 3\n",
      "Author: Baruce A. Bohm -> h-index: 4\n",
      "Author: C. F. Lopez -> h-index: 4\n",
      "Author: M. Román -> h-index: 1\n",
      "Author: Geisa Sereno Velloso da Silva -> h-index: 2\n",
      "Author: M. Nimbalkar -> h-index: 3\n",
      "Author: Louise Cahil -> h-index: 3\n",
      "Author: Slavica Stefanović -> h-index: 2\n",
      "Author: B.Th. Tuyen -> h-index: 1\n",
      "Author: 토마스 크린겐브룬 -> h-index: 3\n",
      "Author: 大薗 和正 -> h-index: 2\n",
      "Author: Viyan Hirori -> h-index: 4\n",
      "Author: M.N.M. Naleef -> h-index: 5\n",
      "Author: Cesiro Guidotti -> h-index: 3\n",
      "Author: Camilo Arturo dir. Saez Alvarez -> h-index: 2\n",
      "Author: Roh Jj -> h-index: 2\n",
      "Author: Chen-Yi Chen -> h-index: 3\n",
      "Author: Carlos García Espinar -> h-index: 3\n",
      "Author: Julia González Calleja -> h-index: 2\n",
      "Author: Палишева Наталья Витальевна -> h-index: 6\n",
      "Author: Богуслав Желински -> h-index: 3\n",
      "Author: Rayan Sidig Adam Abdelgalil -> h-index: 4\n",
      "Author: 吴 子聪 -> h-index: 4\n",
      "Author: Vicki Abrahams -> h-index: 2\n",
      "Author: He Jiangheng -> h-index: 4\n",
      "Author: B. B. Ahrarov -> h-index: 3\n",
      "Author: 賴宏彬 -> h-index: 2\n",
      "Author: ZhaoHuiQU -> h-index: 2\n",
      "Author: 姜祺 -> h-index: 4\n",
      "Author: Monika Barbara Bischoff -> h-index: 3\n",
      "Author: Benoît Geslot -> h-index: 2\n",
      "Author: Fred Dr Ing Hasemann -> h-index: 1\n",
      "Author: R. Nonweiler -> h-index: 4\n",
      "Author: Philomena Chukwu -> h-index: 4\n",
      "Author: П А Проценко -> h-index: 4\n",
      "Author: Phannapa Ruengkij -> h-index: 5\n",
      "Author: D. B. Wiggins -> h-index: 3\n",
      "Author: Е. А. Попова -> h-index: 2\n",
      "Author: Michel Pf -> h-index: 1\n",
      "Author: A. Chait -> h-index: 2\n",
      "Author: Sofija Pavković-Lučić -> h-index: 6\n",
      "Author: 毛谦武 -> h-index: 3\n",
      "Author: 추석 -> h-index: 2\n",
      "Author: Xiong Mingmin -> h-index: 1\n",
      "Author: O. Gokhman -> h-index: 3\n",
      "Author: Mgr.Vladimír Poliak -> h-index: 1\n",
      "Author: Giacinta Tordini -> h-index: 4\n",
      "Author: Yamabet -> h-index: 4\n",
      "Author: Mayme A. Sweet -> h-index: 2\n",
      "Author: Bernd Schulz -> h-index: 4\n",
      "Author: С.Н. Шарапов -> h-index: 1\n",
      "Author: S. López -> h-index: 2\n",
      "Author: 平山 綾 -> h-index: 3\n",
      "Author: Sheila Bromley -> h-index: 2\n",
      "Author: A. Buzzati-Traverso -> h-index: 4\n",
      "Author: Á. Valdivia -> h-index: 3\n",
      "Author: Iinuma Hisae -> h-index: 5\n",
      "Author: Miriam Spina -> h-index: 4\n",
      "Author: Jörg Heinrich -> h-index: 6\n",
      "Author: Christian Hütterer -> h-index: 4\n",
      "Author: Masatsugu Torikawa -> h-index: 2\n",
      "Author: Arinal Marhamah Nur Sakilah -> h-index: 3\n",
      "Author: C. Senad -> h-index: 4\n",
      "Author: G. Madamidola -> h-index: 3\n",
      "Author: KiHyeong Song -> h-index: 4\n",
      "Author: Huacho Susanivar -> h-index: 4\n",
      "Author: Chun-Wen Ku -> h-index: 3\n",
      "Author: Vitor de Andrade Martinez -> h-index: 3\n",
      "Author: G. Soroka -> h-index: 3\n",
      "Author: Javier Fanlo Loras -> h-index: 2\n",
      "Author: Liliana M. Valdés-Vázquez -> h-index: 5\n",
      "Author: Zhengqiang Ni -> h-index: 2\n",
      "Author: Dao-he Wang -> h-index: 3\n"
     ]
    }
   ],
   "source": [
    "main()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
